app/controllers/prospectts_controller.rb

  def index
    @prospectts = Prospectt.all
---
SELECT "prospectts".* FROM "prospectts"

  def create
    @prospectt = Prospectt.new(prospectt_params)


      if @prospectt.save
---
INSERT INTO "prospectts" ("first_name", "last_address", "mail", "company", "job_title", "phone", "created_at", "updated_at", "last_name") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"

  def destroy
    @prospectt.destroy
---
DELETE FROM "prospectts" WHERE "prospectts"."id" = $1  [["id", 1]]

    def set_prospectt
      @prospectt = Prospectt.find(params[:id])
---
SELECT  "prospectts".* FROM "prospectts" WHERE "prospectts"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]