app/controllers/salons_controller.rb

SELECT "salons".* FROM "salons"
---
  def index
    @salons = Salon.all

INSERT INTO "salons" ("first_name", "last_name", "salon", "phone", "email", "adress", "postal_code", "created_at", "updated_at", "message") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10) RETURNING "id"
---
  def create
    @salon = Salon.new(salon_params)


      if @salon.save

DELETE FROM "salons" WHERE "salons"."id" = $1  [["id", 2]]
---
  def destroy
    @salon.destroy

SELECT  "salons".* FROM "salons" WHERE "salons"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
    def set_salon
      @salon = Salon.find(params[:id])